artillery-simpleCheckout.yml
config:
  plugins:
      metrics-by-endpoint: {}
  target: https://kingshark-test.mybigcommerce.com/
  phases:
    - name: warming up
      duration: 30
      arrivalCount: 3
    - name: going up
      duration: 30
      arrivalCount: 6
    - name: holding up
      duration: 60
      arrivalCount: 18
  # Enable the Playwright engine:
  engines:
    playwright: {}
  processor: "./playwright-simpleCheckout.js"
scenarios:
  - engine: playwright
    flowFunction: "simpleCheckout"
    flow: []
    name: simpleCheckout